{"keras_version": "2.2.4", "config": {"layers": [{"config": {"output_dim": 256, "batch_input_shape": [null, 100], "mask_zero": false, "embeddings_constraint": null, "embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "name": "embedding_1", "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "input_length": 100, "input_dim": 26, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_1", "rate": 0.2, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_size": [5], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "padding": "valid", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "conv1d_1", "use_bias": true, "bias_constraint": null, "dilation_rate": [1], "filters": 250, "trainable": true, "strides": [1]}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_1", "data_format": "channels_last", "pool_size": [2], "trainable": true, "padding": "valid", "strides": [2]}, "class_name": "MaxPooling1D"}, {"config": {"name": "dropout_2", "rate": 0.2, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "dense_1", "use_bias": true, "bias_constraint": null, "trainable": true, "units": 650}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "rate": 0.5, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "dense_2", "use_bias": true, "bias_constraint": null, "trainable": true, "units": 1}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "name": "activation_2", "trainable": true}, "class_name": "Activation"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow"}